frostfire45/Codewarrior/Lib/hc12c/include/mc9s12p128.h
  /* Watchdog reset macro */
#ifndef __RESET_WATCHDOG
#ifdef _lint
  #define __RESET_WATCHDOG()  /* empty */
#else
  #define __RESET_WATCHDOG() (void)(CPMUARMCOP = 0x55U, CPMUARMCOP = 0xAAU)
#endif
#endif /* __RESET_WATCHDOG */


/***********************************************/
/**   D E P R E C I A T E D   S Y M B O L S   **/
/***********************************************/
/* --------------------------------------------------------------------------- */
/* The following symbols were removed, because they were invalid or irrelevant */
/* --------------------------------------------------------------------------- */



/* **** 20.05.2008, V3.00.0 */

#define CPMUAPICL                        CPMUAPICTL
#define CPMUAPICL_APIF                   CPMUAPICTL_APIF
#define CPMUAPICL_APIE                   CPMUAPICTL_APIE
#define CPMUAPICL_APIFE                  CPMUAPICTL_APIFE
#define CPMUAPICL_APIEA                  CPMUAPICTL_APIEA
#define CPMUAPICL_APIES                  CPMUAPICTL_APIES
#define CPMUAPICL_APICLK                 CPMUAPICTL_APICLK
#define CPMUAPICL_APIF_MASK              CPMUAPICTL_APIF_MASK
#define CPMUAPICL_APIE_MASK              CPMUAPICTL_APIE_MASK
#define CPMUAPICL_APIFE_MASK             CPMUAPICTL_APIFE_MASK
#define CPMUAPICL_APIEA_MASK             CPMUAPICTL_APIEA_MASK
#define CPMUAPICL_APIES_MASK             CPMUAPICTL_APIES_MASK
#define CPMUAPICL_APICLK_MASK            CPMUAPICTL_APICLK_MASK



/* **** 18.6.2008 V3.00.1 */

#define PT01AD_PT0AD2                    PT01AD_PT1AD2
#define PT01AD_PT0AD3                    PT01AD_PT1AD3
#define PT01AD_PT0AD4                    PT01AD_PT1AD4
#define PT01AD_PT0AD5                    PT01AD_PT1AD5
#define PT01AD_PT0AD6                    PT01AD_PT1AD6
#define PT01AD_PT0AD7                    PT01AD_PT1AD7
#define PT01AD_PT0AD2_MASK               PT01AD_PT1AD2_MASK
#define PT01AD_PT0AD3_MASK               PT01AD_PT1AD3_MASK
#define PT01AD_PT0AD4_MASK               PT01AD_PT1AD4_MASK
#define PT01AD_PT0AD5_MASK               PT01AD_PT1AD5_MASK
#define PT01AD_PT0AD6_MASK               PT01AD_PT1AD6_MASK
#define PT01AD_PT0AD7_MASK               PT01AD_PT1AD7_MASK
#define DDR01AD_DDR0AD2                  DDR01AD_DDR1AD2
#define DDR01AD_DDR0AD3                  DDR01AD_DDR1AD3
#define DDR01AD_DDR0AD4                  DDR01AD_DDR1AD4
#define DDR01AD_DDR0AD5                  DDR01AD_DDR1AD5
#define DDR01AD_DDR0AD6                  DDR01AD_DDR1AD6
#define DDR01AD_DDR0AD7                  DDR01AD_DDR1AD7
#define DDR01AD_DDR0AD2_MASK             DDR01AD_DDR1AD2_MASK
#define DDR01AD_DDR0AD3_MASK             DDR01AD_DDR1AD3_MASK
#define DDR01AD_DDR0AD4_MASK             DDR01AD_DDR1AD4_MASK
#define DDR01AD_DDR0AD5_MASK             DDR01AD_DDR1AD5_MASK
#define DDR01AD_DDR0AD6_MASK             DDR01AD_DDR1AD6_MASK
#define DDR01AD_DDR0AD7_MASK             DDR01AD_DDR1AD7_MASK
#define RDR01AD_RDR0AD2                  RDR01AD_RDR1AD2
#define RDR01AD_RDR0AD3                  RDR01AD_RDR1AD3
#define RDR01AD_RDR0AD4                  RDR01AD_RDR1AD4
#define RDR01AD_RDR0AD5                  RDR01AD_RDR1AD5
#define RDR01AD_RDR0AD6                  RDR01AD_RDR1AD6
#define RDR01AD_RDR0AD7                  RDR01AD_RDR1AD7
#define RDR01AD_RDR0AD2_MASK             RDR01AD_RDR1AD2_MASK
#define RDR01AD_RDR0AD3_MASK             RDR01AD_RDR1AD3_MASK
#define RDR01AD_RDR0AD4_MASK             RDR01AD_RDR1AD4_MASK
#define RDR01AD_RDR0AD5_MASK             RDR01AD_RDR1AD5_MASK
#define RDR01AD_RDR0AD6_MASK             RDR01AD_RDR1AD6_MASK
#define RDR01AD_RDR0AD7_MASK             RDR01AD_RDR1AD7_MASK
#define PER01AD_PER0AD2                  PER01AD_PER1AD2
#define PER01AD_PER0AD3                  PER01AD_PER1AD3
#define PER01AD_PER0AD4                  PER01AD_PER1AD4
#define PER01AD_PER0AD5                  PER01AD_PER1AD5
#define PER01AD_PER0AD6                  PER01AD_PER1AD6
#define PER01AD_PER0AD7                  PER01AD_PER1AD7
#define PER01AD_PER0AD2_MASK             PER01AD_PER1AD2_MASK
#define PER01AD_PER0AD3_MASK             PER01AD_PER1AD3_MASK
#define PER01AD_PER0AD4_MASK             PER01AD_PER1AD4_MASK
#define PER01AD_PER0AD5_MASK             PER01AD_PER1AD5_MASK
#define PER01AD_PER0AD6_MASK             PER01AD_PER1AD6_MASK
#define PER01AD_PER0AD7_MASK             PER01AD_PER1AD7_MASK
#define CPMUIRCTRIMH_IRCTRIM0            CPMUIRCTRIMH_IRCTRIM8
#define CPMUIRCTRIMH_IRCTRIM1            CPMUIRCTRIMH_IRCTRIM9
#define CPMUIRCTRIMH_IRCTRIM0_MASK       CPMUIRCTRIMH_IRCTRIM8_MASK
#define CPMUIRCTRIMH_IRCTRIM1_MASK       CPMUIRCTRIMH_IRCTRIM9_MASK
#define CPMUIRCTRIMH_IRCTRIM_MASK        CPMUIRCTRIMH_IRCTRIM_8_MASK
#define CPMUIRCTRIMH_IRCTRIM_BITNUM      CPMUIRCTRIMH_IRCTRIM_8_BITNUM


/* **** 19.11.2008 9:15:59 */

#define DBGXCTL_NDB_SZ                   This_symb_has_been_depreciated
#define DBGXCTL_NDB_SZ_MASK              This_symb_has_been_depreciated
#define CPMUTEST2                        This_symb_has_been_depreciated


/* **** 28.7.2009 8:59:01 */

#define MMCCTL1                          This_symb_has_been_depreciated
#define MMCCTL1_IFRON                    This_symb_has_been_depreciated
#define MMCCTL1_IFRON_MASK               This_symb_has_been_depreciated


/* **** 14.4.2010 13:33:42 */

#define NVDFPROT_DPS4                    This_symb_has_been_depreciated
#define NVDFPROT_DPS4_MASK               This_symb_has_been_depreciated

#ifndef __V30COMPATIBLE__
#pragma OPTION DEL V30toV31Compatible
#endif
/*lint -restore  +esym(961,18.4) +esym(961,19.7) Enable MISRA rule (1.1,18.4,6.4,19.7) checking. */

#endif
